tutorials/oneD_freely_propagating_flame/1_sample_train/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains      4;

method                  scotch;

simpleCoeffs
{
    n                   (4 1 1);
    delta               0.001;
}

hierarchicalCoeffs
{
    n                   (1 1 1);
    delta               0.001;
    order               xyz;
}

manualCoeffs
{
    dataFile            "";
}

distributed             no;

roots                   ( );


// ************************************************************************* //
