tutorials/oneD_freely_propagating_flame/1_sample_train/system/sampleConfigDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleConfigDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// constant/CanteraTorchProperties settings
CanteraMechanismFile_   placeHolder;
inertSpecie_            placeHolder;

torch_                  off;
GPU_                    on;
log_                    on;
torchModel_             "DNN_model.pt"; 
frozenTemperature_      510;
inferenceDeltaTime_     1e-6;
coresPerNode_           16;

// blockMeshDict settings
domainWidth             placeHolder;
domainLength            placeHolder;
ignitionRegion          placeHolder;

// controlDict & sampling settings
simTimeStep             placeHolder;
simTime                 placeHolder;
simWriteInterval        placeHolder;

// setFieldsDict & 0 dir settings
UInlet                  placeHolder;
pInternal               placeHolder;

unburntStates           placeHolder;
equilibriumStates       placeHolder;

// ************************************************************************* //
